---
kind: method
id: M:Autodesk.Revit.DB.AssemblyInstance.IsMember(Autodesk.Revit.DB.ElementId)
source: html/d66ca433-7280-d951-74ba-7868e7f54376.htm
---
# Autodesk.Revit.DB.AssemblyInstance.IsMember Method

Determines whether the given ElementId is a member of this assembly

## Syntax (C#)
```csharp
public bool IsMember(
	ElementId id
)
```

## Parameters
- **id** (`Autodesk.Revit.DB.ElementId`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null